saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC54000_DFP.2.6.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC54000_DFP</name>
  <description>NXP LPC54000 Series Device Support</description>

  <releases>
    <release version="2.6.0" date="2017-11-17">
      Updated emWin examples to emWin V5.42i.
      Updated Board Support LED_*.c files.
      Updated debug sequences: use read modify write operation on updating DEMCR_Addr to avoid side effects.
    </release>
    <release version="2.5.0" date="2017-09-21">
      Removed LPC54S606, LPC54S608, LPC54S616, LPC54S618 devices not offered by NXP.
      Updated documentation.
    </release>
    <release version="2.4.0" date="2017-06-29">
      Added LPC54628 device support.
      Updated all LPC546xx device support files.
      Updated LPC546xx documentation.
    </release>
    <release version="2.3.0" date="2017-06-02">
      Removed LPCOpen support for LPC5460x device series (not supported by NXP).
      Updated format command options in File Demo example.
      Updated USB Device Audio example for Keil MCB54110 evaluation board.
      Updated documentation.
      Replaced LPC5410x SVD files.
      Updated LPC5460x SVD Files.
      Corrected Debug description syntax errors for Single-Core Variants.
      Added MCB54110 QSG and link to keil.com/boards2 database.
    </release>
    <release version="2.2.0" date="2016-12-22">
      Added LPC54616/54618/54S606/54S608/54S616/54S618 device support.
      Updated debug sequences addressing defects.
      Updated MCB54110 development board examples:
      - configuring CMSIS-DAP debug interface instead of ULINK2.
      - corrected RAM address for Flash algorithm in the DualCore example.
      Updated emWin examples to emWin V5.36f
    </release>
    <release version="2.1.0" date="2016-10-18">
      Added LPC5460x device support (LPC54608, LPC54607, LPC54606, LPC54605)
      Added LPC5460x device support (LPC54608, LPC54607, LPC54606, LPC54605)
      Updated LPC54113, LPC54114 device support
      Updated CMSIS Driver:
      - Updated USART and SPI driver to work with corrected LPCOpen dma_service_5411x.c
      Device Description:
      - Added debugconfig to set debug clock default and protocol
      - Updated debug description to support multi-core devices
      MCB54110 Board Support:
      - Added Audio support and USBD Audio example
      - Updated USB Device CDC ACM VirtualCOM example (corrected initial UART receive size)
      - Updated emWin Examples GLCD_MCB54110.c and LCD_X.c to use Flexcomm Interface 5
    </release>
    <release version="2.0.0" date="2016-05-06">
      Updated LPCOpen firmware package from NXP for LPC5411x devices to V3.00c.001
      Added CMSIS-Driver for I2C, SAI, SPI, USART and USB Device
      Added Board Support for the MCB54110 evaluation board
      - Blinky, DualCore, emWin and Middleware based examples using USB Device and FileSystem
    </release>
    <release version="1.2.0" date="2016-03-03">
      Added LPC5411x device support
      Added LPCOpen V3 firmware package
    </release>
    <release version="1.1.0" date="2015-05-06">
      Updated LED_LPCXpresso54102.c (LPCXpresso board uses different LED pins than Niobe board).
      Renamed devices, subfamily according datasheet
      Added device features
      Added RTX_Blinky example
    </release>
    <release version="1.0.0" date="2014-11-06">
      First Release version of LPC54000 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC54100</keyword>
  </keywords>

  <devices>
    <family Dfamily="LPC54000 Series" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>

      <sequences>

<!-- ************************************************************************************************* -->
<!-- ******************** LPC5410x Device Sequences (SINGLECORE VARIANT) ***************************** -->
<!-- ************************************************************************************************* -->

        <!-- ResetCatchSet Sequence LPC5410x Cortex-M4  -->
        <sequence name="ResetCatchSet_LPC5410x_M4_SingleCore">
          <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY = 0x00000002;
            __var FPB_ENABLE = 0x00000001;
            __var masterCPU = 0x00000000;
            __var CPUCTRL = 0x40000300;
          </block>

          <control if="Dbg_CR == 0x00000000" info="Stop after bootloader disabled">
            <block>
              // Enable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));
            </block>
          </control>

          <control if="Dbg_CR == 0x00000001" info="Stop after bootloader enabled">
            <block>
              // Run over Bootloader
              value = Read32(DEMCR_Addr);
              value &amp;= ~1;                                // Clear Reset Vector Catch
              Write32(DEMCR_Addr, value);                     // Disable Reset Vector Catch
              Write32(0x40000000, 0x00000002);                // Map Flash to Vectors
              value = Read32 (0x00000004);                    // Read Reset Vector
            </block>

            <control if="value &lt; 0x20000000" info="Set and enable breakpoint">
              <block>
                value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                Write32(0xE0002008, value);								    // Set BP0 to Reset Vector
                value = FPB_KEY | FPB_ENABLE;
                Write32(0xe0002000, value);								    // Enable FPB
              </block>
            </control>

            <control if="value &gt;= 0x20000000" info="Enable reset vector catch">
              <block>
              // Enable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));
              </block>
            </control>
          </control>

          <block>
            Read32(DHCSR_Addr);                               // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
          </block>
        </sequence>


        <!-- Reset Processor LPC5410x Cortex-M4 -->
        <sequence name="ResetProcessor_LPC5410x_M4_SingleCore">
          <block>
            Write32(0xE000ED0C, 0x05FA0001);                // Reset Cortex-M4, execute VECTRESET via AIRCR
          </block>
        </sequence>

<!-- ************************************************************************************************* -->
<!-- ******************** LPC5410x Device Sequences (MULTICORE VARIANT) ****************************** -->
<!-- ************************************************************************************************* -->

        <!-- ResetCatchSet Sequence LPC5410x Cortex-M4  -->
        <sequence name="ResetCatchSet_LPC5410x_M4">
          <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY    = 0x00000002;
            __var FPB_ENABLE = 0x00000001;
            __var masterCPU  = 0x00000000;
            __var CPUCTRL    = 0x40000300;

            // Get MasterCPU
            value = Read32( CPUCTRL);                           //  CPU Control register: CPUCTRL (0x40000800)
            value = 0xC0C40000 | (value &amp; 0x0000FFFF);      //  Bit31:16 must be written as 0xC0C4 for the write to have an effect
            value = value &amp; 0xFFFF807D;                     //  Bit1, Bit7:14 should be 0
            masterCPU = value &amp; 0x00000001;
          </block>

          <control if="Dbg_CR == 0x00000000" info="Stop after bootloader disabled">
            <block>
              // Enable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));
            </block>
          </control>

          <control if="Dbg_CR == 0x00000001" info="Stop after bootloader enabled">
            <block>
              // Run over Bootloader
              value = Read32(DEMCR_Addr);
              value &amp;= ~1;                                // Clear Reset Vector Catch
              Write32(DEMCR_Addr, value);                     // Disable Reset Vector Catch
              Write32(0x40000000, 0x00000002);                // Map Flash to Vectors
            </block>

            <control if="masterCPU == 1" info="Cortex-M4 is the master CPU">
              <block>
                value = Read32 (0x00000004);                 // Read Reset Vector
              </block>
            </control>

