saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC54000_DFP.2.6.0.pdsc
          <feature type="UART"          n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="39"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>

          <debug Pname="M4" __dp="0" __ap="0"/>             <!-- AP 0 for Cortex-M4  -->
          <debug Pname="M0plus" __dp="0" __ap="1"/>         <!-- AP 1 for Cortex-M0+ -->

          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor" Pname="M4">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4");
              </block>
            </sequence>

            <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
            <sequence name="ResetProcessor" Pname="M0plus">
              <block>
                Sequence("ResetProcessor_LPC5410x_M0");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet" Pname="M4">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4");
              </block>
            </sequence>

            <!--ResetCatchSet Sequence for Cortex-M0-->
            <sequence name="ResetCatchSet" Pname="M0plus">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M0");
              </block>
            </sequence>


            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart"  Pname="M4">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
            <sequence name="TraceStart"  Pname="M0plus">
              <block>

              </block>
            </sequence>

          </sequences>

        </device>

      </subFamily>

      <!-- ************************  Subfamily 'LPC54110'  **************************** -->
      <subFamily DsubFamily="LPC54110">
        <processor Pname="M4" Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="100000000"/>
        <!--compile Pname="M4" define="CORE_M4"/> With compile it is only possible to set one define.
                                                  using environment is a hack to be able to set an additional define -->
        <environment Pname="M4" name="uv">
          <CMisc>-DCORE_M4</CMisc>
        </environment>

        <debugvars configfile="Debug/LPC541xx.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var LPC541xx_SWO_Pin      = 0;                    // Serial Wire Output pin: 0 = PIO0_15, 1 = PIO1_1
          __var Dbg_CR                = 0x00000000;           // DBG_CR
          __var sCPU_ImageEntry       = 0x00020000;           // Slave CPU Image Start Entry
        </debugvars>

        <book Pname="M4" name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The LPC54110 Series microcontrollers were designed from the ground up to deliver the industry's best power efficiency for always-on sensor-processing applications.
These highly efficient MCUs support ultra-low-power performance for sensor tasks such as listening, collection, and aggregation of sensor data as well as complex sensor processing tasks such as sensor fusion.

Crucial for always-on applications, LPC54100 Series MCUs require as little as 3 uA for continuous sensor listening.
A first for sensor applications, an asymmetric dual-core architecture enables scalable active power/performance:
Developers can use the 55 uA/MHz Cortex-M0+ core for sensor data collection, aggregation, and external communications, or the ARM Cortex-M4 core (100 uA/MHz) to execute math-intensive algorithms (i.e., motion sensor fusion) more quickly while saving power.
The LPC54110 Series also includes single-core (ARM Cortex-M4) options with similar sensor listening and Cortex-M4 power efficiencies.
        </description>

        <!-- *************************  Device 'LPC54113J128BD64'  ***************************** -->
        <device Dname="LPC54113J128BD64">
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug Pname="M4" svd="SVD/LPC54113.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="50"/>
          <feature type="QFP"           n="64"         name="Low-Profile QFP Package"/>

